Documents/ФактическоеИспользованиеРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ФактическоеИспользованиеРесурсов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ФактическоеИспользованиеРесурсов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДоговоровПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Персонал</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Персонал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Персонал</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактЧасыПоТабелю</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Продукты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ФактическоеИспользованиеРесурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ФактическоеИспользованиеРесурсов</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаполненПоСвязаннымДоговорам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДТ1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДТ2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДТ3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДТ4</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ФактическоеИспользованиеРесурсов/Ext/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ФактическоеИспользованиеРесурсов.Записывать = Истина;
	
	ПерсоналСвернутая = Персонал.Выгрузить();
	ПерсоналСвернутая.Свернуть("Договор, СтатьяЗатрат", "Сумма");
	
	Для Каждого ТекСтрокаПерсонал Из ПерсоналСвернутая Цикл
		Движение = Движения.ФактическоеИспользованиеРесурсов.Добавить();
		Движение.Период = Дата;
		Движение.Договор = ТекСтрокаПерсонал.Договор;
		Движение.СтатьяЗатрат = ТекСтрокаПерсонал.СтатьяЗатрат;
		Движение.Сумма = ТекСтрокаПерсонал.Сумма;
	КонецЦикла;
	
	МатериалыСвернутая = Материалы.Выгрузить();
	МатериалыСвернутая.Свернуть("Договор, СтатьяЗатрат, Продукт, Подразделение", "Сумма");
	
	Для Каждого ТекСтрокаМатериал Из МатериалыСвернутая Цикл
		Если ЗначениеЗаполнено(ТекСтрокаМатериал.Договор) Тогда 
			
			Движение = Движения.ФактическоеИспользованиеРесурсов.Добавить();
			Движение.Период = Дата;
			Движение.Договор = ТекСтрокаМатериал.Договор;
			Движение.СтатьяЗатрат = ТекСтрокаМатериал.СтатьяЗатрат;
			Движение.Сумма = ТекСтрокаМатериал.Сумма;
			
		ИначеЕсли ЗначениеЗаполнено(ТекСтрокаМатериал.Продукт) Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Договоры.Ссылка КАК Ссылка,
			|	Договоры.СуммаПоДоговору КАК СуммаПлан
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	Справочник.Договоры КАК Договоры
			|ГДЕ
			|	Договоры.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.ДТ1)
			|	И Договоры.Проект.Продукт = &Продукт
			|	И НЕ Договоры.ПометкаУдаления
			|	И Договоры.СостояниеИсполнения = &СостояниеИсполнения
			|	И Договоры.Сценарий = &Сценарий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ВТ.СуммаПлан) КАК СуммаПлан
			|ПОМЕСТИТЬ ВТ_Сумма
			|ИЗ
			|	ВТ КАК ВТ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Ссылка КАК Ссылка,
			|	ВЫБОР
			|		КОГДА ВТ_Сумма.СуммаПлан <> 0
			|			ТОГДА ВТ.СуммаПлан / ВТ_Сумма.СуммаПлан
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Коэффициент
			|ИЗ
			|	ВТ КАК ВТ,
			|	ВТ_Сумма КАК ВТ_Сумма";
			
			Запрос.УстановитьПараметр("Продукт", ТекСтрокаМатериал.Продукт);
			Запрос.УстановитьПараметр("СостояниеИсполнения", Статус);
			Запрос.УстановитьПараметр("Сценарий", Сценарий); 
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Движение = Движения.ФактическоеИспользованиеРесурсов.Добавить();
				Движение.Период = Дата;
				Движение.Договор = ВыборкаДетальныеЗаписи.Ссылка;
				Движение.СтатьяЗатрат = ТекСтрокаМатериал.СтатьяЗатрат;
				Движение.Сумма = ТекСтрокаМатериал.Сумма*ВыборкаДетальныеЗаписи.Коэффициент;
			КонецЦикла;
			
		//ИначеЕсли ЗначениеЗаполнено(ТекСтрокаМатериал.Подразделение) Тогда 
		//	
		//	Запрос = Новый Запрос;
		//	Запрос.Текст = 
		//	"ВЫБРАТЬ
		//	|	Договоры.Ссылка КАК Ссылка,
		//	|	Договоры.СуммаПоДоговору КАК СуммаПлан
		//	|ПОМЕСТИТЬ ВТ_Договоры
		//	|ИЗ
		//	|	Справочник.Договоры.Подразделения КАК ДоговорыПодразделения
		//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Договоры КАК Договоры
		//	|		ПО ДоговорыПодразделения.Ссылка = Договоры.Ссылка
		//	|ГДЕ
		//	|	Договоры.ПометкаУдаления = ЛОЖЬ
		//	|	И Договоры.ТипДоговора = &ТипДоговора
		//	|	И Договоры.СостояниеИсполнения = &СостояниеИсполнения
		//	|	И ДоговорыПодразделения.Подразделение = &Подразделение
		//	|	И ДоговорыПодразделения.Сценарий = &Сценарий
		//	|;
		//	|
		//	|////////////////////////////////////////////////////////////////////////////////
		//	|ВЫБРАТЬ
		//	|	СУММА(ВТ_Договоры.СуммаПлан) КАК Сумма
		//	|ПОМЕСТИТЬ ВТ_ПлановаяСумма
		//	|ИЗ
		//	|	ВТ_Договоры КАК ВТ_Договоры
		//	|;
		//	|
		//	|////////////////////////////////////////////////////////////////////////////////
		//	|ВЫБРАТЬ
		//	|	ВТ_Договоры.Ссылка КАК Договор,
		//	|	ВЫБОР
		//	|		КОГДА ВТ_ПлановаяСумма.Сумма <> 0
		//	|			ТОГДА ВТ_Договоры.СуммаПлан / ВТ_ПлановаяСумма.Сумма
		//	|		ИНАЧЕ 0
		//	|	КОНЕЦ КАК Коэффициент
		//	|ИЗ
		//	|	ВТ_Договоры КАК ВТ_Договоры,
		//	|	ВТ_ПлановаяСумма КАК ВТ_ПлановаяСумма";
		//	Запрос.УстановитьПараметр("Подразделение", ТекСтрокаМатериал.Подразделение); 
		//	Запрос.УстановитьПараметр("ТипДоговора", Перечисления.ТипыДоговоров.ДТ1);
		//	Запрос.УстановитьПараметр("СостояниеИсполнения", Статус);
		//	Запрос.УстановитьПараметр("Сценарий", Сценарий); 
		//	РезультатЗапроса = Запрос.Выполнить().Выбрать();
		//				
		//	Пока РезультатЗапроса.Следующий() Цикл				
		//		Движение = Движения.ФактическоеИспользованиеРесурсов.Добавить();
		//		
		//		Движение.Период= Дата;
		//		Движение.Договор = РезультатЗапроса.Договор;
		//		Движение.СтатьяЗатрат = ТекСтрокаМатериал.СтатьяЗатрат;
		//		Движение.Сумма = ТекСтрокаМатериал.Сумма * РезультатЗапроса.Коэффициент;
		//		Движение.ЗаполненПоСвязаннымДоговорам = Истина;
		//	КонецЦикла; 			 
			
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Договоры.Ссылка КАК Ссылка,
			|	Договоры.СуммаПоДоговору КАК СуммаПлан
			|ПОМЕСТИТЬ ВТ
			|ИЗ
			|	Справочник.Договоры КАК Договоры
			|ГДЕ
			|	Договоры.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.ДТ1)
			|	И НЕ Договоры.ПометкаУдаления
			|	И Договоры.СостояниеИсполнения = &СостояниеИсполнения
			|	И Договоры.Сценарий = &Сценарий
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	СУММА(ВТ.СуммаПлан) КАК СуммаПлан
			|ПОМЕСТИТЬ ВТ_Сумма
			|ИЗ
			|	ВТ КАК ВТ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ.Ссылка КАК Ссылка,
			|	ВЫБОР
			|		КОГДА ВТ_Сумма.СуммаПлан <> 0
			|			ТОГДА ВТ.СуммаПлан / ВТ_Сумма.СуммаПлан
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК Коэффициент
			|ИЗ
			|	ВТ КАК ВТ,
			|	ВТ_Сумма КАК ВТ_Сумма";
			
			Запрос.УстановитьПараметр("Сценарий", Сценарий); 
			Запрос.УстановитьПараметр("СостояниеИсполнения", Статус);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Движение = Движения.ФактическоеИспользованиеРесурсов.Добавить();
				Движение.Период = Дата;
				Движение.Договор = ВыборкаДетальныеЗаписи.Ссылка;
				Движение.СтатьяЗатрат = ТекСтрокаМатериал.СтатьяЗатрат;
				Движение.Сумма = ТекСтрокаМатериал.Сумма*ВыборкаДетальныеЗаписи.Коэффициент;
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
